---
kind: property
id: P:Autodesk.Revit.DB.Wall.SketchId
zh: 墙、墙体
source: html/cbe78025-7b87-340c-3fe9-d0019a6e7382.htm
---
# Autodesk.Revit.DB.Wall.SketchId Property

**中文**: 墙、墙体

Returns id of the profile sketch, or invalidElementId if sketch does not exist.

## Syntax (C#)
```csharp
public ElementId SketchId { get; }
```

## Remarks
To create profile Sketch for the Wall, call CreateProfileSketch () () () .